<?php
session_start();
 ?>
<!DOCTYPE html>
<html lang="ru">
<head>
  <meta charset="UTF-8">
  <title>SoftGroup test</title>
  <link rel="stylesheet" type="text/css" href="css/style.css" />
</head>
<body>
<div class="wrapper">
  <header>
    <?php
      include 'header_inc.php'
     ?>
  </header>
  <div class="content wrap">
    <div class="sidebar">
      <?php
        include 'sidebar_inc.php';
       ?>
    </div>
    <article>
       <section>
        <h3>Завдання 4</h3>
        <p>Політичне життя однієї країни дуже жваве. У країні діє K політичних
партій, кожна з яких регулярно оголошує національний страйк. Дні, коли
хоча б одна з партій оголошує страйк, за умови, що це не субота або неділя
(коли і так ніхто не працює), завдають великої шкоди економіці країни.
i-та партія оголошує страйки строго кожні bi днів, починаючи з дня з
номером ai. Тобто i-та партія оголошує страйки в дні ai, ai + bi, ai + 2bi і т.д.
Якщо в якийсь день кілька партій оголошує страйк, то це вважається
загальнонаціональним страйком.
У календарі країни N днів, пронумерованих від 1 до N. Перший день
року є понеділком, шостий і сьомий дні року - вихідні, тиждень складається
з семи днів.</p>
      <h4>Вхідні дані</h4>
      <p>
Програма отримує на вхід число днів в році N (1&lt;N&lt;1000000) і число
політичних партій K (1&lt;K&lt;100). Далі йде K рядків, що описують графіки
проведення страйків. i-й рядок містить числа ai і bi (1&lt;ai,bi&lt;N).</p>
      <h4>Вихідні дані</h4>
      <p>Виведіть єдине число: кількість страйків, що відбулися протягом року.</p>
      <h4>Примітка</h4>
      <p>Перша партія оголошує страйки в дні 2, 5, 8, 11, 14, 17. Друга партія
оголошує страйки в дні 3, 8, 13, 18. Третя партія - в дні 9 і 17. Дні номер 6,
7, 13, 14 є вихідними. Таким чином, загальнонаціональні страйки пройдуть в
дні 2, 3, 5, 8, 9, 11, 17, 18.</p>
    </section>
    <div class="decision">
      <form action="" method="post">
        <input type="text" name="num_n" placeholder="Введіть число N">

        <input type="text" name="num_k" placeholder="Введіть число K">
        <input type="submit" value="OK">

      </form>

      <?php
      include 'decision4.php';
       ?>
    </article>
  </div>
  <footer>
    <?php
      include 'footer_inc.php';
     ?>
  </footer>
</div>
</body>
</html>
